<?php

return [
    'Інтернет-магазин засобів захисту рослин AgroPro' => 'Интернет-магазин средств защиты растений AgroPro',

    'Українські фермерські господарства, сільськогосподарські товариства та власники дачних і городніх ділянок активно займаються вирощуванням овочевих та сільськогосподарських культур.' => 'Украинские фермерские хозяйства, сельскохозяйственные общества и владельцы дачных и огородных участков активно занимаются выращиванием овощных и сельскохозяйственных культур.',


    'Магазин AgroPro пропонує широкий асортимент продукції, необхідної для успішного вирощування рослин. Тут можна знайти засоби захисту рослин, фуміганти, посівний матеріал для зернових культур, а також якісні добрива. Вся продукція магазину є сертифікованою і має підтверджену якість. Крім того, фахівці магазину завжди готові надати професійну консультацію та допомогти вибрати необхідний товар як для фермерів, так і для городників.' => 'AgroPro предлагает широкий ассортимент продукции, необходимой для успешного выращивания растений. Здесь можно найти средства защиты растений, фумиганты, посевной материал для зерновых культур, а также качественные удобрения. Вся продукция магазина сертифицирована и имеет подтвержденное качество. Кроме того, специалисты магазина всегда готовы предоставить профессиональную консультацию и помочь выбрать необходимый товар как для фермеров, так и для огородников.',


    'Продукція для саду та городу включає в себе засоби захисту рослин, добрива,
                а також інші необхідні товари.' => 'Продукция для сада и огорода включает в себя средства защиты растений, удобрения,
                а также другие необходимые товары.',

    'Запрошую відвідати наш інтернет-магазин ЗЗР, добрив та насіння, де ви зможете знайти все необхідне без
                виходу
                з дому. У нашому зручному каталозі або скориставшись пошуком ви знайдете' => 'Приглашаю посетить наш интернет-магазин СЗР, удобрений и семян, где вы сможете найти все необходимое без
                выхода
                из дома. В нашем удобном каталоге или воспользовавшись поиском вы найдете',

    'Гербіциди, Інсектициди, Протруйники, Фунгіциди, Десиканти, Прилипачі, Біопрепарати' => 'Гербициды, Инсектициды, Протравители, Фунгициды, Десиканты, Прилипатели, Биопрепараты',

    'Фуміганти, Родентициди, Пастки та принади для гризунів' => 'Фумиганты, Родентициды, Ловушки и приманки для грызунов',

    'Мінеральні добрива, Органічні добрива, Мікродобрива' => 'Минеральные удобрения, Органические удобрения, Микроудобрения',

    'Посівний матеріал соняшнику, кукурудзи та газонної трави' => 'Посевной материал подсолнечника, кукурузы и газонной травы.',

    'Біодеструктори для компостування та вигрібних ям' => 'Биодеструкторы для компостирования и выгребных ям.',

    'Співробітництво з агромагазином AgroPro має безліч переваг' => 'Сотрудничество с агромагазином AgroPro имеет множество преимуществ',

    'Ми маємо понад 10-річний досвід роботи на ринку. Наша команда постійно працює над вдосконаленням процесів
                обслуговування клієнтів. Також ми успішно співпрацюємо з фермерськими господарствами та власниками
                городніх ділянок.' => 'У нас более 10-летний опыт работы на рынке. Наша команда постоянно работает над усовершенствованием процессов
                обслуживание клиентов. Также мы успешно сотрудничаем с фермерскими хозяйствами и владельцами
                огородных участков.',

    'У нашому інтернет-магазині засобів захисту рослин ви знайдете все необхідне для саду та городу. Співпраця
                з AgroPro надає фермерам та городникам такі переваги' => 'В нашем интернет магазине средств защиты растений вы найдете все необходимое для сада и огорода. Сотрудничество
                с AgroPro предоставляет фермерам и огородникам такие преимущества',

    'Широкий вибір: AgroPro пропонує різноманітні товари для сільського господарства, такі як засоби
                    захисту рослин, добрива, посівний матеріал та багато іншого' => 'Широкий выбор: AgroPro предлагает разнообразные товары для сельского хозяйства, такие как средства
                    защиты растений, удобрения, посевной материал и многое другое',

    'Висока якість: Всі товари в асортименті AgroPro проходять сертифікацію і відповідають вимогам якості
                    та безпеки' => 'Высокое качество: Все товары в ассортименте AgroPro проходят сертификацию и отвечают требованиям качества
                    и безопасности',

    'Професійні консультації: Фахівці AgroPro нададуть вам компетентну консультацію щодо вибору
                    оптимальних товарів для вашого господарства чи городу' => 'Профессиональные консультации: Специалисты AgroPro предоставят вам компетентную консультацию по выбору
                    оптимальных товаров для вашего хозяйства или огорода',

    'Зручність покупок: Ви можете замовити необхідні товари в інтернет-магазині AgroPro, що зекономить
                    ваш час та зусилля' => 'Удобство покупок: Вы можете заказать необходимые товары в интернет-магазине AgroPro, что сэкономит
                    ваше время и усилия',

    'В розділі "Статті" ви знайдете відповіді на багато запитань та багато корисних порад з різноманітних
                    тем, пов\'язаних з агропродукцією та сільським господарством' => 'В разделе "Статьи" вы найдете ответы на многие вопросы и много полезных советов по различным вопросам
                    тем, связанных с агропродукцией и сельским хозяйством',

    'Надійність: AgroPro гарантує швидку доставку та надійне обслуговування, щоб зробити ваші покупки
                    максимально комфортними' => 'Надежность: AgroPro гарантирует быструю доставку и надежное обслуживание, чтобы сделать ваши покупки
                    максимально комфортными',

    'Обирайте співробітництво з AgroPro і отримайте доступ до найкращих агропродуктів та послуг' => 'Выбирайте сотрудничество с AgroPro и получите доступ к лучшим агропродуктам и услугам',

    //    '' => '',
    //    '' => '',
    //    '' => '',
    //    '' => '',
    //    '' => '',

];