<?php

?>
<div class="container" id="home-description">
    <hr>
    <h1 style="text-align: center;"><?=Yii::t('home','Інтернет-магазин засобів захисту рослин AgroPro')?></h1>
    <p><?=Yii::t('home','Українські фермерські господарства, сільськогосподарські товариства та власники дачних і городніх ділянок активно займаються вирощуванням овочевих та сільськогосподарських культур.')?>

        <?=Yii::t('home','Магазин AgroPro пропонує широкий асортимент продукції, необхідної для успішного вирощування рослин. Тут можна знайти засоби захисту рослин, фуміганти, посівний матеріал для зернових культур, а також якісні добрива. Вся продукція магазину є сертифікованою і має підтверджену якість. Крім того, фахівці магазину завжди готові надати професійну консультацію та допомогти вибрати необхідний товар як для фермерів, так і для городників.')?>
    </p>
    <div class="full-description" style="display: none;">
        <h2 style="text-align: center;"><?=Yii::t('home','Продукція для саду та городу включає в себе засоби захисту рослин, добрива,
                а також інші необхідні товари.')?></h2>
        <p><?=Yii::t('home','Запрошую відвідати наш інтернет-магазин ЗЗР, добрив та насіння, де ви зможете знайти все необхідне без
                виходу
                з дому. У нашому зручному каталозі або скориставшись пошуком ви знайдете')?>:
        </p>
        <ul>
            <li><?=Yii::t('home','Гербіциди, Інсектициди, Протруйники, Фунгіциди, Десиканти, Прилипачі, Біопрепарати')?></li>
            <li><?=Yii::t('home','Фуміганти, Родентициди, Пастки та принади для гризунів')?></li>
            <li><?=Yii::t('home','Мінеральні добрива, Органічні добрива, Мікродобрива')?></li>
            <li><?=Yii::t('home','Посівний матеріал соняшнику, кукурудзи та газонної трави')?></li>
            <li><?=Yii::t('home','Біодеструктори для компостування та вигрібних ям')?></li>
        </ul>
        <h3 style="text-align: center;"><?=Yii::t('home','Співробітництво з агромагазином AgroPro має безліч переваг')?>:</h3>
        <p><?=Yii::t('home','Ми маємо понад 10-річний досвід роботи на ринку. Наша команда постійно працює над вдосконаленням процесів
                обслуговування клієнтів. Також ми успішно співпрацюємо з фермерськими господарствами та власниками
                городніх ділянок.')?>
        </p>
        <p><?=Yii::t('home','У нашому інтернет-магазині засобів захисту рослин ви знайдете все необхідне для саду та городу. Співпраця
                з AgroPro надає фермерам та городникам такі переваги')?>:
        </p>
        <ul>
            <li><?=Yii::t('home','Широкий вибір: AgroPro пропонує різноманітні товари для сільського господарства, такі як засоби
                    захисту рослин, добрива, посівний матеріал та багато іншого')?>.
            </li>
            <li><?=Yii::t('home','Висока якість: Всі товари в асортименті AgroPro проходять сертифікацію і відповідають вимогам якості
                    та безпеки')?>.
            </li>
            <li><?=Yii::t('home','Професійні консультації: Фахівці AgroPro нададуть вам компетентну консультацію щодо вибору
                    оптимальних товарів для вашого господарства чи городу')?>.
            </li>
            <li><?=Yii::t('home','Зручність покупок: Ви можете замовити необхідні товари в інтернет-магазині AgroPro, що зекономить
                    ваш час та зусилля')?>.
            </li>
            <li><?=Yii::t('home','В розділі "Статті" ви знайдете відповіді на багато запитань та багато корисних порад з різноманітних
                    тем, пов\'язаних з агропродукцією та сільським господарством')?>.
            </li>
            <li><?=Yii::t('home','Надійність: AgroPro гарантує швидку доставку та надійне обслуговування, щоб зробити ваші покупки
                    максимально комфортними')?>.
            </li>
        </ul>
        <p><?=Yii::t('home','Обирайте співробітництво з AgroPro і отримайте доступ до найкращих агропродуктів та послуг')?>!
        </p>
    </div>
    <div style="display: flex; justify-content: center">
        <button class="btn btn-secondary" id="show-more-btn"><?=Yii::t('app','Докладніше...')?> >>></button>
        <button class="btn btn-secondary" id="hide-description-btn" style="display: none;"><?=Yii::t('app','Приховати опис')?>
            <<<
        </button>
    </div>
</div>
